:PROPERTIES:
:ID:       0b6acd63-d091-4c6b-83f6-7d2dd3ce908f
:END:
#+language: en
#+EXPORT_FILE_NAME: ./dealing_with_secrets.md
#+SUBTITLE: Handling secrets (passwords, tokens) safely in clk commands

#+CALL: ../../lp.org:check-result()

#+NAME: init
#+BEGIN_SRC bash :results none :exports none :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f
  . ./sandboxing.sh
#+END_SRC

There are plenty of use cases that need to use some secret value.

Let's dig into how those are done in clk.

Because clk uses click, the most obvious way of using a secret value is to use
[[https://click.palletsprojects.com/en/8.1.x/options/#password-prompts][the click way]], with ~hide_input=True, confirmation_prompt=True, prompt=True~:
This will ask twice for the password, hiding the input.

For the sake of the example, let's imagine you create a tool that calls some
http endpoint that requires a bearer token.

Something that would be called like this.

#+BEGIN_SRC bash :results none :exports code
  clk http --base-url http://somesite --bearer sometoken get /something
#+END_SRC

This translates into something that looks like the following python code.

#+NAME: command
#+BEGIN_SRC python :results none :exports code
  class HTTPConfig:
      pass

  @group()
  @option("--bearer", help="The bearer token to request the API", prompt=True, confirmation_prompt=True, hide_input=True, expose_class=HTTPConfig)
  @option("--base-url", help="The url of the site to play with", expose_class=HTTPConfig)
  def http():
      "Commands to play with some OAuth 2 protected site"

  @http.command()
  @argument("path", help="The endpoint to call")
  def get(path):
      "Perform a get request from the site"
      print(f"Calling {config.http.base_url}/{path} with bearer token {config.http.bearer}")

#+END_SRC

#+NAME: createthecommand
#+BEGIN_SRC bash :results none :exports none :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :noweb yes
  clk command create python --group http
  cat<<EOF >> "${CLKCONFIGDIR}/python/http.py"
  <<command>>
  EOF

#+END_SRC

If you simply use that command, it will prompt you for the password. This may be
not very practical if you are used to call this command pretty often.

To get more information about the pattern behind ~expose_class=HTTPConfig~, see
the tutorial about [[file:dynamic_parameters_and_exposed_class.org][dynamic parameters]].

You may be tempted to add the secret in a simple parameter, like this.

#+NAME: setsecretinparameter
#+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
  clk parameter set http --bearer mytoken
#+END_SRC

#+RESULTS[43a7457422e8407720a3f8f303221aef490d4a05]: setsecretinparameter
: New global parameters for http: --bearer mytoken

#+NAME: usesecretinparameter
#+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
  clk http --base-url someurl get someendpoint
#+END_SRC

#+RESULTS[158a00a9080e5ab95503802e0a00fdd22a999100]: usesecretinparameter
: Calling someurl/someendpoint with bearer token mytoken

This works, but it keeps the bearer token in plain text into the clk
parameters. That is not ideal security-wise.

What we can do instead is use a special value for this parameter that tells clk
to lookup the value in your password manager instead.

#+NAME: usethebearefromsecret
#+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
  clk parameter set http --bearer noeval:secret:http_bearer
#+END_SRC

#+RESULTS[55f18bd97a0c0c1631569bc276ad5278fb2272cd]: usethebearefromsecret
: Removing global parameters of http: --bearer mytoken
: New global parameters for http: --bearer secret:http_bearer

Here is some explanation:
1. the ~noeval:~ prefix tells clk not to replace the following content, so that the secret is not actually looked up when you create the parameter. That way, the parameter will be the literal ~secret:http_bearer~ instead of its content,
2. ~secret:http_bearer~ tells clk to get the secret from your secret manager at the key ~http_bearer~


If the secret is not there, clk will fail and tell you that it could not find it.

#+NAME: httpwithsecretfail
#+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
  clk http --base-url someurl get someendpoint
#+END_SRC

#+RESULTS[158a00a9080e5ab95503802e0a00fdd22a999100]: httpwithsecretfail
: error: Could not find the secret for http_bearer

Now, there are two situations: either you have access to a password manager, or
you don't.

* if you don't have access to a password manager
  :PROPERTIES:
  :CUSTOM_ID: d1ea176b-444a-4808-a5db-ff7c27767d4e
  :END:

  If ~clk~ needs to get access to a secret but you don't have a password
  manager, it will fail[fn:1]. But you can tell ~clk~ to ask you for the
  password by providing the ~--ask-secret~ flag.

  #+NAME: askforpassword
  #+BEGIN_SRC bash :results none :exports code
    clk --ask-secret http --base-url someurl get someendpoint
  #+END_SRC

  #+NAME: generate_expect_file_success
  #+BEGIN_SRC bash :results none :exports none :noweb yes :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f

    # GENERATED USING AUTOEXPECT
    cat<<"EOEXPECT" > "pass.exp"
    #!/usr/bin/expect -f
    #
    # This Expect script was generated by autoexpect on Wed Jun 21 10:25:46 2023
    # Expect and autoexpect were both written by Don Libes, NIST.
    #
    # Note that autoexpect does not guarantee a working script.  It
    # necessarily has to guess about certain things.  Two reasons a script
    # might fail are:
    #
    # 1) timing - A surprising number of programs (rn, ksh, zsh, telnet,
    # etc.) and devices discard or ignore keystrokes that arrive "too
    # quickly" after prompts.  If you find your new script hanging up at
    # one spot, try adding a short sleep just before the previous send.
    # Setting "force_conservative" to 1 (see below) makes Expect do this
    # automatically - pausing briefly before sending each character.  This
    # pacifies every program I know of.  The -c flag makes the script do
    # this in the first place.  The -C flag allows you to define a
    # character to toggle this mode off and on.

    set force_conservative 0  ;# set to 1 to force conservative mode even if
                  ;# script wasn't run conservatively originally
    if {$force_conservative} {
        set send_slow {1 .1}
        proc send {ignore arg} {
            sleep .1
            exp_send -s -- $arg
        }
    }

    #
    # 2) differing output - Some programs produce different output each time
    # they run.  The "date" command is an obvious example.  Another is
    # ftp, if it produces throughput statistics at the end of a file
    # transfer.  If this causes a problem, delete these patterns or replace
    # them with wildcards.  An alternative is to use the -p flag (for
    # "prompt") which makes Expect only look for the last line of output
    # (i.e., the prompt).  The -P flag allows you to define a character to
    # toggle this mode off and on.
    #
    # Read the man page for more info.
    #
    # -Don


    set timeout -1
    spawn <<askforpassword>>
    match_max 100000
    expect -exact "warning: Could not find the secret for http_bearer\r
    Please provide the secret http_bearer: "
    send -- "test\r"
    expect -exact "\r
    Repeat for confirmation: "
    send -- "test\r"
    expect eof
    EOEXPECT

  #+END_SRC

  #+NAME: call_ask_for_real
  #+BEGIN_SRC bash :results verbatim :exports results :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
    expect pass.exp |tail -n+2
  #+END_SRC

  #+RESULTS[aa836fe911f7603e903d9063dedf0ab46f782b25]: call_ask_for_real
  : warning: Could not find the secret for http_bearer
  : Please provide the secret http_bearer:
  : Repeat for confirmation:
  : Calling someurl/someendpoint with bearer token test

  As you can see, the error message became a warning message and it falls back
  on asking you to provide manually the secret.

  #+NAME: generate_expect_file_error
  #+BEGIN_SRC bash :results none :exports none :noweb yes :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f

    # GENERATED USING AUTOEXPECT
    cat<<"EOEXPECT" > "passerror.exp"
    #!/usr/bin/expect -f
    #
    # This Expect script was generated by autoexpect on Wed Jun 21 10:25:46 2023
    # Expect and autoexpect were both written by Don Libes, NIST.
    #
    # Note that autoexpect does not guarantee a working script.  It
    # necessarily has to guess about certain things.  Two reasons a script
    # might fail are:
    #
    # 1) timing - A surprising number of programs (rn, ksh, zsh, telnet,
    # etc.) and devices discard or ignore keystrokes that arrive "too
    # quickly" after prompts.  If you find your new script hanging up at
    # one spot, try adding a short sleep just before the previous send.
    # Setting "force_conservative" to 1 (see below) makes Expect do this
    # automatically - pausing briefly before sending each character.  This
    # pacifies every program I know of.  The -c flag makes the script do
    # this in the first place.  The -C flag allows you to define a
    # character to toggle this mode off and on.

    set force_conservative 0  ;# set to 1 to force conservative mode even if
                  ;# script wasn't run conservatively originally
    if {$force_conservative} {
        set send_slow {1 .1}
        proc send {ignore arg} {
            sleep .1
            exp_send -s -- $arg
        }
    }

    #
    # 2) differing output - Some programs produce different output each time
    # they run.  The "date" command is an obvious example.  Another is
    # ftp, if it produces throughput statistics at the end of a file
    # transfer.  If this causes a problem, delete these patterns or replace
    # them with wildcards.  An alternative is to use the -p flag (for
    # "prompt") which makes Expect only look for the last line of output
    # (i.e., the prompt).  The -P flag allows you to define a character to
    # toggle this mode off and on.
    #
    # Read the man page for more info.
    #
    # -Don


    set timeout -1
    spawn <<askforpassword>>
    match_max 100000
    expect -exact "warning: Could not find the secret for http_bearer\r
    Please provide the secret http_bearer: "
    send -- "something\r"
    expect -exact "\r
    Repeat for confirmation: "
    send -- "somethingelse\r"
    expect -exact "Error: The two entered values do not match.\r"
    expect -exact "Please provide the secret http_bearer:"
    EOEXPECT

  #+END_SRC

  #+NAME: call_ask_for_real_error
  #+BEGIN_SRC bash :results verbatim :exports results :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
    expect passerror.exp |tail -n+2
  #+END_SRC

  If you don't provide the same value, the program will continuously ask for it
  until you successfully provide the secret or stop it..

  #+RESULTS[5d40bd23fcb962553c2669cf06b74757548668fc]: call_ask_for_real_error
  : warning: Could not find the secret for http_bearer
  : Please provide the secret http_bearer:
  : Repeat for confirmation:
  : Error: The two entered values do not match.
  : Please provide the secret http_bearer:
* impact on completion
  :PROPERTIES:
  :CUSTOM_ID: cfb1d97c-78ab-4f1f-bdbd-e7222f5503a9
  :END:

  The fact that a secret is missing should not impact the completion, hence if
  you try to complete the following, the code should provide the appropriate
  completion without failing.

  #+NAME: sequence-to-complete
  #+BEGIN_SRC bash :results none :exports none
    http --base-ur
  #+END_SRC

  #+NAME: ask-for-completion
  #+BEGIN_SRC bash :results none :exports code :noweb yes
    clk <<sequence-to-complete>><TAB>
  #+END_SRC

  #+NAME: try-completion
  #+BEGIN_SRC bash :results verbatim :exports results :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :noweb yes :cache yes
    clk completion try --remove-bash-formatting --last <<sequence-to-complete>>
  #+END_SRC

  #+RESULTS[0028e363126d3fafc32884425fac0fcba53524e6]: try-completion
  : --base-url

  Even if you use ~--ask-secret~.

  #+NAME: ask-for-completion-ask
  #+BEGIN_SRC bash :results none :exports code :noweb yes
    clk --ask-secret <<sequence-to-complete>><TAB>
  #+END_SRC

  #+NAME: try-completion-without-ask-secret
  #+BEGIN_SRC bash :results verbatim :exports results :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :noweb yes :cache yes
    clk --ask-secret completion try --remove-bash-formatting --last <<sequence-to-complete>>
  #+END_SRC

  #+RESULTS[ffdc8dcf50e669e487bfa37f956f15b2ac50c088]: try-completion-without-ask-secret
  : --base-url
* if you have access to a password manager
  :PROPERTIES:
  :CUSTOM_ID: 61f05dde-58fc-47b7-bb78-0af9f98e36b4
  :END:

  If you have access to a password manager and want to use it, here is how you
  would proceed.

  Every password manager has its particularities, therefore ~clk~ does not try
  to guess where the secret is located. It uses [[https://github.com/jaraco/keyring][keyring]] to deal with secrets and
  provides a few commands to lookup and store secrets using keyring.

  #+NAME: providepassword
  #+BEGIN_SRC bash :results none :exports none :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f
    clk secret set --set-parameter global --secret mytoken
  #+END_SRC

  To store a secret, use this command:

  #+NAME: storeasecret
  #+BEGIN_SRC bash :results none :exports code :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f
    clk secret set http_bearer
  #+END_SRC

  As you can see, you don't directly write the secret in the command line, for the
  same reasons explained above.

  Let's assume for the sake of this use case that you typed "mytoken" when
  prompted for a value.

  Then, you can look up a secret with:

  #+NAME: showsecret
  #+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
    clk secret show http_bearer
  #+END_SRC

  #+RESULTS[442139aba4b7a95e06870afa13c4062b5dec3796]: showsecret
  : http_bearer *****

  The secret is not actually shown, to avoid secrets to easily show up when you
  don't want them to. What this command tells is that a secret actually exists
  associated to that key. The only information that you have is that there
  indeed exists a secret with that name.

  To have ~clk~ show the secret, you need to add the ~--secret~ flag.

  #+NAME: reallyshowsecret
  #+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
    clk secret show http_bearer --secret
  #+END_SRC

  #+RESULTS[929e49b3d0d6a80136cd215c9aadabdf4df6ad03]: reallyshowsecret
  : http_bearer mytoken

  It might look cumbersome to simply see this piece of information, but this is
  actually the point: avoiding leaking your password.

  In case you want to provide this secret to another command and just want the
  secret, nothing more.

  #+NAME: reallyshowonlysecret
  #+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
    clk secret show http_bearer --secret --field secret
  #+END_SRC

  #+RESULTS[8e3cb798399ccc8ddaed0841489aaaa0f6833598]: reallyshowonlysecret
  : mytoken

  Now, putting things together, the previous command will work as expected.

  #+NAME: httpwithsecret
  #+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
    clk http --base-url someurl get someendpoint
  #+END_SRC

  #+RESULTS[158a00a9080e5ab95503802e0a00fdd22a999100]: httpwithsecret
  : Calling someurl/someendpoint with bearer token mytoken
* using the secret in your command
  :PROPERTIES:
  :CUSTOM_ID: 469f9507-471b-460f-9859-0cb1f03b1b4e
  :END:

  This secret can also be used directly in the source code, using the ~get_secret~
  function from clk.

  #+NAME: getsecretfromcode
  #+BEGIN_SRC python :results none :exports code
    from clk import get_secret

    @command()
    def dosomething():
        'Example of using secrets'
        click.echo(get_secret('http_bearer'))
  #+END_SRC

  #+NAME: testgetsecret
  #+BEGIN_SRC bash :results none :exports none :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :noweb yes
    clk command create python dosomething --force
    cat<<EOF >> "${CLKCONFIGDIR}/python/dosomething.py"
    <<getsecretfromcode>>
    EOF
  #+END_SRC

  #+NAME: showgetsecret
  #+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
    clk dosomething
  #+END_SRC

  #+RESULTS[fe7117e23eb4a4761ac86c0a87df09b6dbf0a85c]: showgetsecret
  : mytoken
* remove the secret
  :PROPERTIES:
  :CUSTOM_ID: 087fcd23-cb6b-4602-848a-fc88ee24a48c
  :END:
  You can remove this secret now using the unset command. But beware that the
  command won't work anymore as its parameter explicitly lookup for this secret.

  #+NAME: forcingtheremoval
  #+BEGIN_SRC bash :results none :exports none :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f
    clk parameter set secret.unset --force
  #+END_SRC

  #+NAME: removingsecret
  #+BEGIN_SRC bash :results none :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f
    clk secret unset http_bearer
  #+END_SRC

  Then, you can verify that the secret is gone.

  #+NAME: checkthatthesecretisgone
  #+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
    clk secret show http_bearer
  #+END_SRC

  #+RESULTS[442139aba4b7a95e06870afa13c4062b5dec3796]: checkthatthesecretisgone
  : warning: No secret set
* using your own secret provider, or the built-in netrc one
  :PROPERTIES:
  :CUSTOM_ID: c49aeb51-0523-4521-9de3-717def168162
  :ID:       1ff4115c-af33-4c97-a343-a49148bf2ec8
  :END:

  The secret feature of ~clk~ is only a small wrapper on top of [[https://github.com/jaraco/keyring][keyring]]. If you
  configured keyring to use a backend, it will be used in clk.

  If you want to overwrite this in ~clk~, you can pass the import value in the
  ~--keyring~ option.

  For example, clk comes with a keyring to read secrets from netrc, implemented by
  the class ~NetrcKeyring~ of the module ~clk.keyrings~.

  Let's try to use netrc to provide the secret. The built-in netrc keyring
  assume that the secret name is put in the field ~machine~ of the netrc file
  and that the secret is in the field password.

  Write this content in ~~/.netrc~

  #+NAME: netrc_content
  #+BEGIN_SRC authinfo :results none :exports code
    machine http_bearer
    password thevalue
  #+END_SRC

  #+NAME: generate_netrc
  #+BEGIN_SRC bash :results none :exports none :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :noweb yes
    cat <<EOF > "${CLK_NETRC_LOCATION}"
    <<netrc_content>>
    EOF
  #+END_SRC

  Then, you can tell ~clk~ to use this keyring by providing the appropriate
  value to the ~--keyring~ option.

  #+NAME: using_netrc
  #+BEGIN_SRC bash :results verbatim :exports both :session 0b6acd63-d091-4c6b-83f6-7d2dd3ce908f :cache yes
    clk --keyring clk.keyrings.NetrcKeyring secret show http_bearer --secret
  #+END_SRC

  #+RESULTS[188657ac16cc36b600645ebd0256dc6c3129c671]: using_netrc
  : http_bearer thevalue

  #+NAME: test
  #+BEGIN_SRC bash :results none :exports none :noweb yes :shebang "#!/bin/bash -eu" :tangle ../../tests/use_cases/dealing_with_secrets.sh
    <<init>>

    <<createthecommand>>

    check-result(setsecretinparameter)

    check-result(usesecretinparameter)

    check-result(usethebearefromsecret)

    check-result(httpwithsecretfail)

    <<generate_expect_file_success>>

    check-result(call_ask_for_real)

    <<generate_expect_file_error>>

    check-result(call_ask_for_real_error)

    check-result(try-completion)

    check-result(try-completion-without-ask-secret)

    <<providepassword>>

    <<storeasecret>>

    check-result(showsecret)

    check-result(reallyshowsecret)

    check-result(reallyshowonlysecret)

    check-result(httpwithsecret)

    <<testgetsecret>>

    check-result(showgetsecret)

    <<forcingtheremoval>>

    <<removingsecret>>

    check-result(checkthatthesecretisgone)

    <<generate_netrc>>

    check-result(using_netrc)

  #+END_SRC
* Footnotes
  :PROPERTIES:
  :CUSTOM_ID: 2a4a6980-6bfa-446e-882e-b99e854043b8
  :END:

[fn:1] this is so that if you use ~clk~ in scripts, you will be aware that something went wrong
